#  Создайте программу, которая принимает список чисел и возвращает новый список, содержащий квадраты всех чисел из первоначального списка, используя генераторы списков.

# создаем переменную в которую присваиваем введенные числа, конвертируемые в тип данных int   
inputed_list = list(map(int, input("Введите числа: ").split()))
# создаем новый лист
newSqrt_list = []

# циклом проходим все элементы списка inputed_list
for el in inputed_list:
  # добавляем в список newSqrt_list значения старого списка, возведенные в квадрат
  newSqrt_list.append(el ** 2)

# выводим старый список
print(f"Старый лист: {inputed_list}")
# выводим новый список
print(f"Лист с квадратами чисел: {newSqrt_list}")


